tobozo/esp32-DCF77_Analyzer_Clock/UI.h
#ifndef _UI_H_
#define _UI_H_


void touchLoop();
void touchCalibrate();
//#include <XPT2046_Touchscreen.h>
#define TOUCH_CS 21 // enable touch
#define TOUCH_FREQ 20000000

//XPT2046_Touchscreen ts(TOUCH_CS);

//#define LGFX_ONLY

#ifndef LGFX_ONLY

  // using ESP32-Chimera-Core device list

  //#define LGFX_ONLY
  #undef LGFX_AUTODETECT
  #define LGFX_LOLIN_D32_PRO
  #include <ESP32-Chimera-Core.h> // https://github.com/tobozo/ESP32-Chimera-Core or regular M5Stack Core
  #define tft M5.Lcd // syntax sugar
  #define Display320x240 // warn: 320x240 frame buffer may exceed available ram, use tft.setColorDepth( 8 )


  void M5Begin()
  {

    #ifdef TOUCH_CS
    M5.setTouchSpiShared( TOUCH_CS ); // call this before M5.begin() !!
    #endif

    if( SERIAL_SPEED != 115200 ) {
      M5.begin(true, SD_ENABLE, false);
      Serial.begin( SERIAL_SPEED );
    } else {
      M5.begin();
    }

    tft.drawRect(10,10,20,20,0xFFFF);
    tft.print("BLAH");
    delay(1000);

    #ifdef TOUCH_CS
    if( M5.ts == nullptr ) {
      Serial.println("No touch mounted, aborting");
      while(1);
    }

    uint16_t calData[5] = { 808, 2241, 599, 3448, 0 };
    tft.setTouch(calData);

    while(1) {
      touchLoop();
    }
    #endif

  }


#else

  // bypassing LovyanGFX device detection

  #include <LovyanGFX.hpp>
  #include <Wire.h>

  // Custom SD config
  #include <SD.h>           // or SD_MMC.h, SPIFFS.h, LittleFS.h
  #define M5STACK_SD SD     // or SD_MMC,   SPIFFS,   LittleFS
  #define USE_TFCARD_CS_PIN // comment in/out if necessary
  #define TFCARD_CS_PIN 13  // edit if necessary
  //#define DisplayPanel lgfx::Panel_ST7735S
  #define DisplayPanel lgfx::Panel_ILI9341
  #define Display320x240

  // custom TFT config
  struct LGFX_Config
  {
    // values picked from /LovyanGFX/src/config/
    /*
    // pinout TTGO_TS
    static constexpr spi_host_device_t spi_host = VSPI_HOST;
    static constexpr int dma_channel = 1;
    static constexpr int spi_mosi = 23;
    static constexpr int spi_miso = -1;
    static constexpr int spi_sclk =  5;
    */
    // pinout LoLin D32Pro for ILI9341
    static constexpr spi_host_device_t spi_host = VSPI_HOST;
    static constexpr int dma_channel = 1;
    static constexpr int spi_sclk = 18;
    static constexpr int spi_mosi = 23;
    static constexpr int spi_miso = 19;
    static constexpr int spi_dlen = 8;
  };
  static DisplayPanel panel; // panel name picked from /LovyanGFX/src/lgfx/panel/
  //typedef lgfx::LGFX_SPI<LGFX_Config> LGFX;
  //static LGFX tft;

  static lgfx::LGFX_SPI<LGFX_Config> tft;
  //static LGFX tft;

  #include <ESP32-Chimera-Core.h> // https://github.com/tobozo/ESP32-Chimera-Core or regular M5Stack Core

  void M5Begin()
  {
    Serial.begin( SERIAL_SPEED );
    Serial.printf("Custom ESP32 started at %d bauds!", SERIAL_SPEED);

    // custom TFT pinout
    /*
    // Panel_TTGO_TS panel, pinout picked from /LovyanGFX/src/lgfx/panel/
    panel.freq_write = 20000000;
    panel.panel_width  = 128;
    panel.panel_height = 160;
    panel.offset_x     = 2;
    panel.offset_y     = 1;
    panel.offset_rotation = 2;
    panel.rgb_order = true;
    panel.spi_3wire = true;
    panel.spi_cs    = 16;
    panel.spi_dc    = 17;
    panel.gpio_rst  = 9;
    panel.gpio_bl   = 27;
    panel.pwm_ch_bl = 7;
    */


    // Panel pinout for LoLin D32Pro + ILI9341
    panel.freq_write = 20000000;
    panel.freq_fill  = 27000000;
    panel.freq_read  = 16000000;
    panel.spi_mode = 0;
    panel.spi_mode_read = 0;
    panel.len_dummy_read_pixel = 8;
    panel.spi_read = true;
    panel.spi_3wire = false;
    panel.spi_cs = 14;
    panel.spi_dc = 27;
    panel.gpio_rst = 33;
    panel.gpio_bl  = 32;
    panel.pwm_ch_bl = 7;
    panel.backlight_level = true;
    panel.invert = false;
    panel.rgb_order = false;
    panel.memory_width  = 240;
    panel.memory_height = 320;
    panel.panel_width  = 240;
    panel.panel_height = 320;
    panel.offset_x = 0;
    panel.offset_y = 0;
    panel.rotation = 0;
    panel.offset_rotation = 0;

    tft.setPanel(&panel);
    tft.init();


    tft.drawRect(10,10,20,20,0xFFFF);
    tft.print("BLAH");
    delay(1000);

    tft.clearScreen();

    touchCalibrate();


    while(1) {
      touchLoop();
    }

    #if defined ( USE_TFCARD_CS_PIN ) && defined( TFCARD_CS_PIN )

      log_d("Enabling SD from TFCARD_CS_PIN (%d)", TFCARD_CS_PIN);

      M5STACK_SD.end();
      SPI.end();
      SPI.begin();
      M5STACK_SD.begin(TFCARD_CS_PIN, SPI, 20000000);

      if ( LGFX_Config::spi_host == HSPI_HOST ) {
        tft.setSPIShared(false);
      }
    #else
      log_d("Enabling SD_MMC");
      M5STACK_SD.begin();
      tft.setSPIShared(false);
    #endif

  }


#endif



#ifdef TOUCH_CS
// Code to run a screen calibration, not needed when calibration values set in setup()
void touchCalibrate()
{
  uint16_t calData[5];
  uint8_t calDataOK = 0;

  // Calibrate
  tft.fillScreen(TFT_BLACK);
  tft.setCursor(20, 0);
  tft.setTextFont(2);
  tft.setTextSize(1);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);

  tft.println("Touch corners as indicated");

  tft.setTextFont(1);
  tft.println();

  tft.calibrateTouch(calData, TFT_MAGENTA, TFT_BLACK, 15);

  Serial.println(); Serial.println();
  Serial.println("// Use this calibration code in setup():");
  Serial.print("  uint16_t calData[5] = ");
  Serial.print("{ ");

  for (uint8_t i = 0; i < 5; i++)
  {
    Serial.print(calData[i]);
    if (i < 4) Serial.print(", ");
  }

  Serial.println(" };");
  Serial.print("  tft.setTouch(calData);");
  Serial.println(); Serial.println();

  tft.fillScreen(TFT_BLACK);

  tft.setTextColor(TFT_GREEN, TFT_BLACK);
  tft.println("Calibration complete!");
  tft.println("Calibration code sent to Serial port.");

  delay(4000);
}

boolean wastouched = true;
void touchLoop()
{
  boolean istouched = M5.ts->touched();
  if (istouched) {
    TS_Point p = M5.ts->getPoint();

    p.x = map(p.x, 540, 3200, 0, tft.width() );
    p.y = map(p.y, 196, 4096, 0, tft.height() );

    if (!wastouched) {
      //tft.print("Touchstart");
    }

