tobozo/esp32-DCF77_Analyzer_Clock/UI.h
static const char weekStr[] = "SMTWTFS";

void drawWeekDays( int daynum )
{

  int hpos = sprite.width();
  int vpos = sprite.height();
  int margin = 1;

  int boxWidth = LedWeekStatusFontWidth + (margin);
  int boxHeight = (LedWeekStatusFontHeight + (margin*2))-1;

  int boxCenterX = boxWidth/2 - margin;
  int boxCenterY = boxHeight/2 + margin*2;

  hpos -= (boxWidth*7);
  vpos -= (boxHeight);

  setFontStyle( &sprite, LedWeekStatusFontStyle );

  for ( byte pos = 0; pos < 7; pos++ ) {
    if ( daynum > -1 && daynum == pos ) {
      sprite.fillCircle( hpos+(boxWidth/2), vpos-2, 1, TFT_ORANGE );
      sprite.fillRect( hpos, vpos, boxWidth, boxHeight, TFT_DARKRED );
      sprite.setTextColor( TFT_UGRAY );
    } else {
      sprite.fillCircle( hpos+(boxWidth/2), vpos-2, 1, TFT_DARKGRAY );
      sprite.drawCircle( hpos+(boxWidth/2), vpos-2, 1, TFT_GRAY );
      if( pos == 0 || pos == 6 ) {
        sprite.fillRect( hpos, vpos, boxWidth, boxHeight, TFT_ORANGE );
      } else {
        sprite.fillRect( hpos, vpos, boxWidth, boxHeight, TFT_LIGHTGRAY );
      }
      sprite.setTextColor( TFT_GRAY );
    }
    sprite.drawChar( weekStr[pos],  hpos+boxCenterX, vpos+boxCenterY );
    hpos += boxWidth;
  }

}

void LedWeekStatus( int weekDay, int status )
{
  int xpos = tft.width() - ( weekDayNamesWidth + 1 );
  //int ypos = ( tft.height() - (LedWeekStatusFontHeight) ) - 3;
  int weekDayBlockWidth = LedWeekStatusFontWidth + 2;
  int wpos = -1;

  switch ( weekDay ) {
    case 22: // LED_SUNDAY    // output - LED - Sunday
      wpos = 0;
      xpos += 0;
    break;
    case 23: // LED_MONDAY    // output - LED - Monday
      wpos = 1;
      xpos += weekDayBlockWidth;
    break;
    case 24: // LED_TUESDAY   // output - LED - Tuesday
      wpos = 2;
      xpos += weekDayBlockWidth * 2;
    break;
    case 25: // LED_WEDNESDAY // output - LED - Wednesday
      wpos = 3;
      xpos += weekDayBlockWidth * 3;
    break;
    case 26: // LED_THURSDAY  // output - LED - Thursday
      wpos = 4;
      xpos += weekDayBlockWidth * 4;
    break;
    case 27: // LED_FRIDAY    // output - LED - Friday
      wpos = 5;
      xpos += weekDayBlockWidth * 5;
    break;
    case 28: // LED_SATURDAY  // output - LED - Saturday
      wpos = 6;
      xpos += weekDayBlockWidth * 6;
    break;
    case 29: // LED_CEST      // output - LED - Summertime CEST
      takeMuxSemaphore();
      setFontStyle( &sprite, status ?  BoxSelected->style : BoxUnSelected->style );
      sprite.fillRect( CESTXpos, CETCESTYPos - LedWeekStatusFontHeight - 1, CESTWidth + 2, LedWeekStatusFontHeight+1, status ? BoxSelected->fillColor : BoxUnSelected->fillColor );
      sprite.drawString( "CEST", CESTXpos + 1, (CETCESTYPos - LedWeekStatusFontHeight) );
      giveMuxSemaphore();
      return;
    break;
    case 30: // LED_CET       // output - LED - Wintertime CET
      takeMuxSemaphore();
      setFontStyle( &sprite, status ?  BoxSelected->style : BoxUnSelected->style );
      sprite.fillRect( CETXPos, CETCESTYPos - LedWeekStatusFontHeight - 1, CETWidth + 2, LedWeekStatusFontHeight+1, status ? BoxSelected->fillColor : BoxUnSelected->fillColor );
      sprite.drawString( "CET", CETXPos + 1, (CETCESTYPos - LedWeekStatusFontHeight) );
      giveMuxSemaphore();
      return;
    break;
    case 31: // LED_LEAPYEAR  // output - LED - Leap year
      takeMuxSemaphore();
      setFontStyle( &sprite, status ?  BoxSelected->style : BoxUnSelected->style );
      sprite.fillRect( LEAPXPos, LeapYearYpos - LedWeekStatusFontHeight - 1, LEAPWidth + 2, LedWeekStatusFontHeight+1, status ? BoxSelected->fillColor : BoxUnSelected->fillColor );
      sprite.drawString( "LEAP", LEAPXPos + 1, (LeapYearYpos - LedWeekStatusFontHeight) );
      giveMuxSemaphore();
      return;
    break;
    case 51: // LED_WEEKNUMBER
      char weekNumStr[5];
      sprintf( weekNumStr, "W:%02d", weekNumber );
      takeMuxSemaphore();
      setFontStyle( &sprite, weekNumber > 0 ?  BoxSelected->style : BoxUnSelected->style );
      tmpFontWidth = sprite.textWidth( weekNumStr );
      sprite.fillRect( tft.width() - (tmpFontWidth + 2), WeekNumberYpos - 1, tmpFontWidth + 2, LedWeekStatusFontHeight+1, weekNumber > 0 ? BoxSelected->fillColor : BoxUnSelected->fillColor );
      sprite.drawString( String( weekNumStr ), tft.width() - (tmpFontWidth + 1), WeekNumberYpos );
      giveMuxSemaphore();
      return;
    break;
    default:
      log_d("Invalid weekDay: %d", weekDay);
      return;
  }

  takeMuxSemaphore();
  if( wpos > -1 ) {
    drawWeekDays( wpos );
  }
  giveMuxSemaphore();
}


void setRingLed( byte ringNum, byte ledNum, bool enable, bool clear )
{
  //float i = ( float( ledNum - 60 / 2 ) / 60) * TWO_PI;
  float x1, y1;
  uint16_t fillcolor, shinecolor;
  byte r = 0;
  switch ( ringNum ) {
    case 0: // inner
      x1 = ringLedCoords[0][ledNum].x;
      y1 = ringLedCoords[0][ledNum].y;
      r = int_ringLedRadius;
      break;
    case 1: // outer
      x1 = ringLedCoords[1][ledNum].x;
      y1 = ringLedCoords[1][ledNum].y;
      r = int_ringLedRadius;
      break;
    default:
      log_d( "Invalid ringNum: %d", ringNum );
      return;
  }
  takeMuxSemaphore();
  if ( enable ) {
    switch ( ledNum ) {
      case 20: // start
      case 28: // p1
      case 35: // p2
      case 58: // p3
        fillcolor = TFT_GREENISH;
        shinecolor = TFT_WHITE;
        break;
      default:
        fillcolor = TFT_RED;
        shinecolor = TFT_UGRAY;
    }
    sprite.fillCircle( x1, y1, r, fillcolor );
    if (r > 1) {
      sprite.fillTriangle( x1, y1 - 1, x1 + 1, y1 - 1, x1 + 1, y1, shinecolor );
    }
  } else {
    if( clear ) {
      sprite.fillCircle( x1, y1, r, TFT_DARKGRAY );
      sprite.drawCircle( x1, y1, r, TFT_LIGHTGRAY );
    } else {
      sprite.fillCircle( x1, y1, r, TFT_LIGHTGRAY );
      sprite.fillTriangle( x1, y1 - 1, x1 + 1, y1 - 1, x1 + 1, y1, TFT_WHITE );
    }
  }
  giveMuxSemaphore();
}


void setRingCoords()
{
  for ( uint8_t ledNum = 0; ledNum < 60; ledNum++ ) {
    float i = ( float( ledNum - 60 / 2 ) / 60 ) * TWO_PI;
    float x1, y1, x2, y2, x3, y3, x4, y4;
    x1 = ( -sin(i) * r1 ) + TFT_HALFWIDTH;
    y1 = ( cos(i)  * r1 ) + TFT_HALFHEIGHT;
    x2 = ( -sin(i) * r2 ) + TFT_HALFWIDTH;
    y2 = ( cos(i)  * r2 ) + TFT_HALFHEIGHT;
    x3 = ( -sin(i) * r3 ) + TFT_HALFWIDTH;
    y3 = ( cos(i)  * r3 ) + TFT_HALFHEIGHT;
    x4 = ( -sin(i) * r4 ) + TFT_HALFWIDTH;
    y4 = ( cos(i)  * r4 ) + TFT_HALFHEIGHT;
    // cache coords
    ringLedCoords[0][ledNum] = {x1, y1};
    ringLedCoords[1][ledNum] = {x2, y2};
    ringLedCoords[2][ledNum] = {x3, y3};
    ringLedCoords[3][ledNum] = {x4, y4};
  }
}


void drawRing()
{
  takeMuxSemaphore();

  setFontStyle( &sprite, RingLabelsFontStyle );

